<properties
  pagetitle="Azure Sentinel - Threat Intelligence Data Connectors - Threat Intelligence Platforms (TIP)"
  description=""
  service=""
  resource=""
  ms.author="yaronsahar"
  selfhelptype="Generic"
  supporttopicids="32786021"
  productpesids="16690"
  cloudenvironments="public, fairfax, mooncake, blackforest, ussec, usnat"
  disableclouds=""
  articleid="55b168f6-8ba6-4ffe-b794-11fe288d9fb7"
  ownershipid="Azure_Sentinel" />
# Azure Sentinel - Threat Intelligence Data Connectors - Threat Intelligence Platforms (TIP)

## **Recommended Steps**

If you never received data, or haven't received data since you made the initial connection, complete these steps.

1. Open the Azure Portal and navigate to the Azure Sentinel service.   
1. Choose the workspace where you have imported threat indicators using the TAXII Data Connector.  
1. Navigate to the **Data Connectors** section under the **Configuration** pane.  
1. Open the **Threat Intelligence Platforms (Preview)** data connector.  
1. Check the last indicator's received time on the Graph shown on the left pane of the **Connectors** page. 
1. Select **Go to Log Analytics** to see if any indicators are listed in Log Analytics.
1. Run this query: 

```
ThreatIntelligenceIndicator 
| where SourceSystem == 'SecurityGraph'
```

## **Recommended Documents**

* [Add threat indicators to Azure Sentinel with the Threat Intelligence Platforms data connector](https://docs.microsoft.com/azure/sentinel/import-threat-intelligence#adding-threat-indicators-to-azure-sentinel-with-the-threat-intelligence-platforms-data-connector)
* [Connect data from threat intelligence providers](https://docs.microsoft.com/azure/sentinel/connect-threat-intelligence)
* [Bring threat intelligence from Sixgill using TAXII Data Connector](https://techcommunity.microsoft.com/t5/azure-sentinel/bring-threat-intelligence-from-sixgill-using-taxii-data/ba-p/1965440)
* [Bring your threat intelligence to Azure Sentinel](https://techcommunity.microsoft.com/t5/azure-sentinel/bring-your-threat-intelligence-to-azure-sentinel/ba-p/1167546)
