<properties
  pagetitle="Azure Sentinel - Threat Intelligence Data Connectors - Indicator filtering issues"
  description=""
  service=""
  resource=""
  ms.author="yaronsahar"
  selfhelptype="Generic"
  supporttopicids="32786017"
  productpesids="16690"
  cloudenvironments="public, fairfax, mooncake, blackforest, ussec, usnat"
  disableclouds=""
  articleid="e66747f8-e2b9-4eaf-a987-d9cd741cd0e6"
  ownershipid="Azure_Sentinel" />
# Azure Sentinel - Threat Intelligence Data Connectors - Indicator filtering issues

## **Recommended Steps**

If not all TAXII Server values are shown in Source filter on Threat Intelligence Blade, complete the following steps:	
	
1. Open the Azure portal and navigate to the Azure Sentinel service.   
1. Choose the workspace into which you have imported TI Data.   
1.  Select **Threat Intelligence (Preview)** from the **Threat Management** section of Azure Sentinel.  
1.  Make sure that not all values are showing up in the source filter.  
1.  Run this query in Log Analytics to make sure you have data for that particular TAXII Server that is not showing:  
     
     ```
     ThreatIntelligenceIndicator 
     |where SourceSystem== 'Friendly name of TAXII server'

     ```

## **Recommended Documents**

* [Add threat indicators to Azure Sentinel with the Threat Intelligence Platforms data connector](https://docs.microsoft.com/azure/sentinel/import-threat-intelligence#adding-threat-indicators-to-azure-sentinel-with-the-threat-intelligence-platforms-data-connector)
* [Connect data from threat intelligence providers](https://docs.microsoft.com/azure/sentinel/connect-threat-intelligence)
* [Bring threat intelligence from Sixgill using TAXII Data Connector](https://techcommunity.microsoft.com/t5/azure-sentinel/bring-threat-intelligence-from-sixgill-using-taxii-data/ba-p/1965440)
* [Bring your threat intelligence to Azure Sentinel](https://techcommunity.microsoft.com/t5/azure-sentinel/bring-your-threat-intelligence-to-azure-sentinel/ba-p/1167546)
